## Plan Result (cftptl - Job)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 10 to change, 3 to destroy.</code></pre>

* Update
  * azapi_resource.AIServices
  * azapi_resource.AIServicesConnection
  * azapi_resource.project
  * azurerm_cosmosdb_account.cosmosdb
  * azurerm_resource_group.this
  * azurerm_search_service.this
  * azurerm_storage_account.default
  * azurerm_user_assigned_identity.managed_identity
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
* Replace
  * azurerm_cosmosdb_sql_role_assignment.search_service_reader
  * azurerm_role_assignment.search_search_reader
  * azurerm_role_assignment.storage_blob_data_reader_search_service




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_search_service.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_search_service" "this" {
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "platops-slack-help-bot-ptl"
      + partition_count               = (known after apply)
      + primary_key                   = (sensitive value)
      + public_network_access_enabled = (known after apply)
      + query_keys                    = (known after apply)
      + replica_count                 = (known after apply)
      + resource_group_name           = "slack-help-bot-cftptl-intsvc-rg"
      + secondary_key                 = (sensitive value)
      + tags                          = (known after apply)
    }

  # azapi_resource.AIServices will be updated in-place
  ~ resource "azapi_resource" "AIServices" {
        id                        = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.CognitiveServices/accounts/platops-slack-help-bot-ptl"
        name                      = "platops-slack-help-bot-ptl"
      ~ output                    = jsonencode(
            {
              - etag       = "\"f0000f1b-0000-1100-0000-6742be6a0000\""
              - id         = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.CognitiveServices/accounts/platops-slack-help-bot-ptl"
              - identity   = {
                  - principalId = "4585f7f7-f363-4eb9-95a7-78c43e2de5ab"
                  - tenantId    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                  - type        = "SystemAssigned"
                }
              - kind       = "AIServices"
              - location   = "uksouth"
              - name       = "platops-slack-help-bot-ptl"
              - properties = {
                  - armFeatures                = [
                      - "Microsoft.CognitiveServices/OpenAIPreview",
                      - "Microsoft.CognitiveServices/OpenAIFineTune",
                    ]
                  - callRateLimit              = {
                      - rules = [
                          - {
                              - count         = 20
                              - key           = "documentTranslation.post"
                              - matchPatterns = [
                                  - {
                                      - method = "POST"
                                      - path   = "translator/text/batch/*"
                                    },
                                ]
                              - renewalPeriod = 1
                            },
                          - {
                              - count         = 20
                              - key           = "documentTranslation.get"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "translator/text/batch/*"
                                    },
                                ]
                              - renewalPeriod = 1
                            },
                          - {
                              - count         = 20
                              - key           = "documentTranslation.default"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "translator/text/batch/*"
                                    },
                                ]
                              - renewalPeriod = 1
                            },
                          - {
                              - count         = 100
                              - key           = "textTranslation"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "translator/text/*"
                                    },
                                ]
                              - renewalPeriod = 1
                            },
                          - {
                              - count         = 20
                              - key           = "singledocumentTranslation.default"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "translator/document:translate"
                                    },
                                ]
                              - renewalPeriod = 1
                            },
                          - {
                              - count         = 20
                              - key           = "batchDocumentTranslation.post"
                              - matchPatterns = [
                                  - {
                                      - method = "POST"
                                      - path   = "translator/document/*"
                                    },
                                ]
                              - renewalPeriod = 1
                            },
                          - {
                              - count         = 20
                              - key           = "batchDocumentTranslation.get"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "translator/document/*"
                                    },
                                ]
                              - renewalPeriod = 1
                            },
                          - {
                              - count         = 20
                              - key           = "batchDocumentTranslation.default"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "translator/document/*"
                                    },
                                ]
                              - renewalPeriod = 1
                            },
                          - {
                              - count         = 1000
                              - key           = "workflow.endpoint.postcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "language/:analyze-conversations"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 1000
                              - key           = "textAnalytics.conversations.jobs.getcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/analyze-conversations/jobs/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 1000
                              - key           = "textAnalytics.conversations.jobs.postcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "POST"
                                      - path   = "language/analyze-conversations/jobs"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 1000
                              - key           = "textAnalytics.analyzetext.postcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "POST"
                                      - path   = "language/:analyze-text"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 1000
                              - key           = "textAnalytics.analyzetext.jobs.getcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/analyze-text/jobs/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 300
                              - key           = "textAnalytics.analyzetext.jobs.postcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "POST"
                                      - path   = "language/analyze-text/jobs"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.analyzedocuments.jobs.getcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/analyze-documents/jobs/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.analyzedocuments.jobs.postcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "POST"
                                      - path   = "language/analyze-documents/jobs"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 1000
                              - key           = "textAnalytics.generate.postcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "language/:generate"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.authoring.customtext.getcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/analyze-text/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 10
                              - key           = "textAnalytics.unifiedAuthoring.updatecalls"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "language/analyze-text/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.authoring.customtext.march.getcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/authoring/analyze-text/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 10
                              - key           = "textAnalytics.unifiedAuthoring.march.updatecalls"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "language/authoring/analyze-text/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.authoring.customtext.internal.getcalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/analyze-text/internal/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 10
                              - key           = "textAnalytics.unifiedAuthoring.internal.updatecalls"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "language/analyze-text/internal/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.unifiedAuthoring.clu.getCalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/analyze-conversations/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 10
                              - key           = "textAnalytics.unifiedAuthoring.clu.updateCalls"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "language/analyze-conversations/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.unifiedAuthoring.clu.march.getCalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/authoring/analyze-conversations/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 10
                              - key           = "textAnalytics.unifiedAuthoring.clu.march.updateCalls"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "language/authoring/analyze-conversations/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.unifiedAuthoring.clu.internal.getCalls"
                              - matchPatterns = [
                                  - {
                                      - method = "GET"
                                      - path   = "language/analyze-conversations/internal/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 10
                              - key           = "textAnalytics.unifiedAuthoring.clu.internal.updateCalls"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "language/analyze-conversations/internal/projects/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count         = 100
                              - key           = "textAnalytics.customText"
                              - matchPatterns = [
                                  - {
                                      - method = "*"
                                      - path   = "text/analytics/v3.1-preview.ct.1/analyze/*"
                                    },
                                ]
                              - renewalPeriod = 60
                            },
                          - {
                              - count                    = 300
                              - dynamicThrottlingEnabled = true
                              - key                      = "textAnalytics.analyze"
                              - matchPatterns            = [
                                  - {
                                      - method = "*"
                                      - path   = "text/analytics/v3.1/analyze/*"
                                    },
                                  - {
                                      - method = "*"
                                      - path   = "text/analytics/v3.2-preview.1/analyze/*"
                                    },
                                  - {
                                      - method = "*"
                                      - path   = "text/analytics/v3.2-preview.2/analyze/*"
                                    },
                                ]
                              - renewalPeriod            = 60
                            },
                          

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - CustomTranslator                                    = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - DocumentTranslation                                 = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - FormRecognizer                                      = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - LUIS                                                = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - Language                                            = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Microsoft Azure Multimodal Intelligence"           = "https://platops-slack-help-bot-ptl.services.ai.azure.com/"
                      - "Mistral AI API"                                    = "https://platops-slack-help-bot-ptl.services.ai.azure.com/"
                      - "OpenAI Dall-E API"                                 = "https://platops-slack-help-bot-ptl.openai.azure.com/"
                      - "OpenAI Language Model Instance API"                = "https://platops-slack-help-bot-ptl.openai.azure.com/"
                      - "OpenAI Model Scaleset API"                         = "https://platops-slack-help-bot-ptl.openai.azure.com/"
                      - "OpenAI Realtime API"                               = "https://platops-slack-help-bot-ptl.openai.azure.com/"
                      - "OpenAI Sora API"                                   = "https://platops-slack-help-bot-ptl.openai.azure.com/"
                      - "OpenAI Whisper API"                                = "https://platops-slack-help-bot-ptl.openai.azure.com/"
                      - QnAMaker                                            = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - QuestionAnswering                                   = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Audio Content Creation"            = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Batch Avatar"                      = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Batch Text to Speech"              = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Custom Avatar"                     = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Custom Voice"                      = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Custom Voice Trial"                = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Speaker Identification"            = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Speaker Verification"              = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Speech to Text"                    = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Speech to Text (Standard)"         = "https://uksouth.stt.speech.microsoft.com"
                      - "Speech Services Speech to Text 2024-05-15-preview" = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Speech to Text 2024-11-15"         = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Speech to Text v3.2"               = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Speech to Text v3.2_internal.1"    = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Speech Services Text to Speech (Neural)"           = "https://uksouth.tts.speech.microsoft.com"
                      - "Text Analytics"                                    = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - TextTranslation                                     = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - TextTranslation-Global                              = "https://api.cognitive.microsofttranslator.com/"
                      - Token                                               = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Token Service API"                                 = "https://platops-slack-help-bot-ptl.openai.azure.com/"
                      - Turing                                              = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Video Translation"                                 = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                      - "Voice Agent Realtime API"                          = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                    }
                  - internalId                 = "90eb5788d09141bdb4f482270f73264f"
                  - isMigrated                 = false
                  - privateEndpointConnections = []
                  - provisioningState          = "Succeeded"
                  - publicNetworkAccess        = "Enabled"
                }
              - sku        = {
                  - name = "S0"
                }
              - systemData = {
                  - createdAt          = "2024-07-16T15:48:38.6705206Z"
                  - createdBy          = "tim.jacomb@justice.gov.uk"
                  - createdByType      = "User"
                  - lastModifiedAt     = "2024-08-15T09:30:56.6290103Z"
                  - lastModifiedBy     = "tim.jacomb@justice.gov.uk"
                  - lastModifiedByType = "User"
                }
              - tags       = {
                  - application  = "core"
                  - builtFrom    = "hmcts/slack-help-bot"
                  - businessArea = "CFT"
                  - criticality  = "High"
                  - environment  = "production"
                  - startupMode  = "always"
                }
              - type       = "Microsoft.CognitiveServices/accounts"
            }
        ) -> (known after apply)
      ~ tags                      = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          ~ "startupMode"  = "always" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azapi_resource.AIServicesConnection will be updated in-place
  ~ resource "azapi_resource" "AIServicesConnection" {
      ~ body                      = jsonencode(
            {
              - properties = {
                  - authType      = "AAD"
                  - category      = "AIServices"
                  - isSharedToAll = true
                  - metadata      = {
                      - ApiType    = "Azure"
                      - ResourceId = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.CognitiveServices/accounts/platops-slack-help-bot-ptl"
                    }
                  - target        = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                }
            }
        ) -> (known after apply)
        id                        = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.MachineLearningServices/workspaces/platops-slack-help-bot-hub-ptl/connections/platops-slack-help-bot-ptl"
      + location                  = (known after apply)
        name                      = "platops-slack-help-bot-ptl"
      ~ output                    = jsonencode(
            {
              - id         = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.MachineLearningServices/workspaces/platops-slack-help-bot-hub-ptl/connections/platops-slack-help-bot-ptl"
              - location   = null
              - name       = "platops-slack-help-bot-ptl"
              - properties = {
                  - authType                    = "AAD"
                  - category                    = "AIServices"
                  - createdByWorkspaceArmId     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.MachineLearningServices/workspaces/platops-slack-help-bot-hub-ptl"
                  - error                       = null
                  - expiryTime                  = null
                  - group                       = "AzureAI"
                  - isSharedToAll               = true
                  - metadata                    = {
                      - ApiType    = "Azure"
                      - ResourceId = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.CognitiveServices/accounts/platops-slack-help-bot-ptl"
                    }
                  - peRequirement               = "NotRequired"
                  - peStatus                    = "NotApplicable"
                  - sharedUserList              = []
                  - target                      = "https://platops-slack-help-bot-ptl.cognitiveservices.azure.com/"
                  - useWorkspaceManagedIdentity = false
                }
              - systemData = {
                  - createdAt          = "2024-07-22T09:14:33.4754255Z"
                  - createdBy          = "tim.jacomb@justice.gov.uk"
                  - createdByType      = "User"
                  - lastModifiedAt     = "2024-07-22T09:14:33.4754255Z"
                  - lastModifiedBy     = "tim.jacomb@justice.gov.uk"
                  - lastModifiedByType = "User"
                }
              - tags       = null
              - type       = "Microsoft.MachineLearningServices/workspaces/connections"
            }
        ) -> (known after apply)
      + tags                      = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azapi_resource.project will be updated in-place
  ~ resource "azapi_resource" "project" {
        id                        = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.MachineLearningServices/workspaces/platops-slack-help-bot-ptl"
        name                      = "platops-slack-help-bot-ptl"
      ~ output                    = jsonencode({}) -> (known after apply)
      ~ tags                      = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          ~ "startupMode"  = "always" -> ""
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_cosmosdb_account.cosmosdb will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "cosmosdb" {
        id                                       = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.DocumentDB/databaseAccounts/platops-slack-help-bot-ptl"
        name                                     = "platops-slack-help-bot-ptl"
      ~ tags                                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (35 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_role_assignment.search_service_reader must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "search_service_reader" {
      ~ id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.DocumentDB/databaseAccounts/platops-slack-help-bot-ptl/sqlRoleAssignments/f8cf1fdf-9213-de7b-7337-bd3f23aea372" -> (known after apply)
      ~ name                = "f8cf1fdf-9213-de7b-7337-bd3f23aea372" -> (known after apply)
      ~ principal_id        = "61335d45-3cad-4bba-b395-c5dab8a7e05e" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # azurerm_resource_group.this will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg"
        name       = "slack-help-bot-cftptl-intsvc-rg"
      ~ tags       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.search_search_reader must be replaced
-/+ resource "azurerm_role_assignment" "search_search_reader" {
      ~ id                                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.DocumentDB/databaseAccounts/platops-slack-help-bot-ptl/providers/Microsoft.Authorization/roleAssignments/ff87c1b6-93b3-e401-b875-9781850a89b1" -> (known after apply)
      ~ name                                   = "ff87c1b6-93b3-e401-b875-9781850a89b1" -> (known after apply)
      ~ principal_id                           = "61335d45-3cad-4bba-b395-c5dab8a7e05e" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Authorization/roleDefinitions/fbdf93bf-df7d-467e-a4d2-9458aa1360c8" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.storage_blob_data_reader_search_service must be replaced
-/+ resource "azurerm_role_assignment" "storage_blob_data_reader_search_service" {
      ~ id                                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Storage/storageAccounts/platopslackhelpbotai/providers/Microsoft.Authorization/roleAssignments/980c7893-2df6-4a6e-7bbf-7d94ea0eb247" -> (known after apply)
      ~ name                                   = "980c7893-2df6-4a6e-7bbf-7d94ea0eb247" -> (known after apply)
      ~ principal_id                           = "61335d45-3cad-4bba-b395-c5dab8a7e05e" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Authorization/roleDefinitions/2a2b9908-6ea1-4ae2-8e65-a410df84e7d1" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_search_service.this will be updated in-place
  ~ resource "azurerm_search_service" "this" {
        id                                       = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Search/searchServices/platops-slack-help-bot-ptl"
        name                                     = "platops-slack-help-bot-ptl"
      ~ tags                                     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_storage_account.default will be updated in-place
  ~ resource "azurerm_storage_account" "default" {
        id                                 = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Storage/storageAccounts/platopslackhelpbotai"
        name                               = "platopslackhelpbotai"
      ~ tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (97 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_user_assigned_identity.managed_identity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/managed-identities-cftptl-intsvc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/slack-help-bot-cftptl-intsvc-mi"
        name                = "slack-help-bot-cftptl-intsvc-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Insights/components/slack-help-bot-ptl"
        name                                  = "slack-help-bot-ptl"
      ~ tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - slack-help-bot-ptl"
        name                = "Application Insights daily cap reached - slack-help-bot-ptl"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/slack-help-bot"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 10 to change, 3 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":560,"Program":"tfcmt","SHA1":"","Target":"cftptl - Job","Vars":{}} -->